In [2]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School","Wilson High School","Wright High School"]

In [3]:
for key, value in high_school_types[index].items():

SyntaxError: unexpected EOF while parsing (67384119.py, line 1)

In [4]:
for i in [Hernandez High School, Figueroa High School, Wilson High School, Wright High School]:
    print(i, end=", ")

SyntaxError: invalid syntax (822106204.py, line 1)

In [6]:
print(Hernandez High School, Figueroa High School, Wilson High School, Wright High School)

SyntaxError: invalid syntax (1176636852.py, line 1)

In [8]:
for high_schools in range(len(high_schools))
    print high_schools[high_schools]

SyntaxError: invalid syntax (3084544313.py, line 1)

In [9]:
first = high_schools[0]
print(first)

Hernandez High School

In [13]:
result = high_schools[:4]
print(result)

['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']

In [3]:
for h in high_schools:
    print(h)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [7]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [9]:
for h in high_school_types:
    result = ', '.join(f'"{key}": "{value}"' for key, value in h.items())
    print(result)  
#This is a nested FOR LOOP.  Outer helps iterate thru the HS types list and the inner 
#does the iteration of key value pairs of ea dictionary.

"High School": "Griffin", "Type": "District"
"High School": "Figueroa", "Type": "District"
"High School": "Wilson", "Type": "Charter"
"High School": "Wright", "Type": "Charter"

In [10]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School",
                "Wilson High School", "Cabrera High School", "Bailey High School", 
                "Holden High School", "Pena High School", "Wright High School",
                "Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [2]:
# Add the Pandas dependency.
import pandas as pd

In [12]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [17]:
school_series.items()
print(school_series.items)

<bound method Series.items of 0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object>

In [18]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [19]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [20]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [21]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [22]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [31]:
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

schools_df["School ID"] = school_id
schools_df["School_name"] = school_name
type_of_school = ["District", "District", "Charter", "District","Charter"]
schools_df
schools_df["type"] = type_of_school
schools_df

   School ID            School_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [32]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [33]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [37]:
schools_df = pd.DataFrame()
schools_df["School ID"] = school_id
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [38]:
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]
schools_df["School_name"] = school_name
schools_df

   School ID            School_name
0          0      Huang High School
1          1   Figueroa High School
2          2    Shelton High School
3          3  Hernandez High School
4          4    Griffin High School

In [39]:
type_of_school = ["District", "District", "Charter", "District","Charter"]
schools_df["type"] = type_of_school
schools_df

   School ID            School_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [3]:
df = pd.read_csv("Book1.csv")
df

                    Name
0  Hernandez High School
1   Figueroa High School
2     Wilson High School
3     Wright High School